Revit 2024 API
Frame Properties
The Frame type exposes the following members.
Properties
Name | Description
BasisX
 The first basis vector of the frame.
BasisY
 The second basis vector of the frame.
BasisZ
 The third basis vector of the frame.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Origin
 The frame's base point.
See Also
Frame Class
Autodesk.Revit.DB Namespace